[
  {
    "company": "Apple",
    "role": "Senior Lead Software Engineer",
    "period": "August 2024 - Present",
    "achievements": [
      "Architected Spring Boot 3.5.4 microservices for a streaming platform serving millions of daily requests with 99.95% uptime.",
      "Led migration from Agile PLM to Siemens Teamcenter PLM, implementing Kafka integrations that reduced manual intervention by 85%.",
      "Designed real-time cache refresh with CockroachDB change feeds, reducing staleness from 30s to <100ms for 500K+ users.",
      "Optimized system efficiency by 30% and reduced API response times from 800ms to 350ms through critical code refactoring.",
      "Leveraged AI tools (MCP, Roo Code) to cut feature development time by 20-30% while maintaining code quality.",
      "Mentored 7 engineers and drove a 35% reduction in production incidents through rigorous code reviews."
    ]
  },
  {
    "company": "Fiserv",
    "role": "Senior Software Engineer (Cloud Migration Lead)",
    "period": "May 2023 - July 2024",
    "achievements": [
      "Spearheaded cloud migration to Red Hat OpenShift, reducing deployment time from 4 hours to 12 minutes.",
      "Architected private cloud infrastructure with service mesh, improving availability from 99.5% to 99.95%.",
      "Modernized full-stack apps with React/Redux and GraphQL, improving user engagement metrics by 32%.",
      "Designed DynamoDB models achieving 50% query performance improvement and 30% cost reduction.",
      "Reduced Mean Time To Recovery (MTTR) by 60% through DevOps collaboration and infrastructure improvements."
    ]
  },
  {
    "company": "Zions Bancorporation",
    "role": "Java Application Developer",
    "period": "June 2021 - April 2023",
    "achievements": [
      "Architected reactive GraphQL service handling 10M+ daily requests, reducing server memory footprint by 25%.",
      "Implemented Kafka-based microservices for near-real-time data sync with 99.99% message delivery guarantee.",
      "Engineered DynamoDB implementation with sub-100ms latency for multi-billion record datasets.",
      "Optimized database performance, increasing throughput from 5K to 15K transactions/second.",
      "Automated deployment and monitoring with Unix shell scripts, saving 30 hours of manual work per week."
    ]
  },
  {
    "company": "Comerica Bank",
    "role": "Lead Java/J2EE Developer",
    "period": "April 2020 - May 2021",
    "achievements": [
      "Led a team of 5 developers to improve deployment frequency from monthly to bi-weekly for digital banking.",
      "Architected ESB integration processing 100M+ monthly transactions with sub-second response times.",
      "Migrated monolithic J2EE app to Spring microservices, reducing memory consumption by 40%.",
      "Optimized SQL queries to reduce transaction processing time by 50%."
    ]
  },
  {
    "company": "Blue Cross and Blue Shield",
    "role": "Senior Software Engineer",
    "period": "March 2018 - March 2020",
    "achievements": [
      "Designed microservices for claims processing (5M+ daily) with 99.98% accuracy.",
      "Implemented Spring Boot REST APIs integrating with 20+ downstream systems.",
      "Improved report generation time from 45 minutes to 8 minutes through database tuning.",
      "Achieved 85% code coverage and reduced production defects by 40% with automated testing."
    ]
  }
]